rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
/**
 * @file ESP32Synth.cpp
 * @author Danilo Gabriel
 * @brief Implementation file for the ESP32Synth polyphonic synthesizer library.
 *        (Arquivo de implementação para a biblioteca de sintetizador polifônico ESP32Synth.)
 * @version 2.3.5-beta
 */
#include "ESP32Synth.h"

// =================================================================================
// Global Constants & LUTs
// =================================================================================

// --- Sine Wave Look-Up Table (Tabela de Consulta de Onda Senoidal) ---
#define SINE_LUT_SIZE 4096
#define SINE_LUT_MASK (SINE_LUT_SIZE - 1)
#define SINE_SHIFT    20 // 32 total bits - 12 table bits = 20 bits for phase shift

// --- Global Tables (Tabelas Globais) ---
int32_t sineLUT[SINE_LUT_SIZE];
SampleData registeredSamples[MAX_SAMPLES];


// =================================================================================
// Core Rendering Blocks (IRAM_ATTR)
// =================================================================================

/**
 * @brief Renders an audio block for a sample-based voice.
 *        (Renderiza um bloco de áudio para uma voz baseada em sample.)
 */
static void IRAM_ATTR renderBlockSample(Voice* vo, int32_t* mixBuffer, int samples, int32_t startEnv, int32_t envStep) {
    if (vo->sampleFinished) return;
    const SampleData* sData = &registeredSamples[vo->curSampleId];
    if (!sData->data) return;

    const int16_t* data = sData->data;
    const uint32_t len = sData->length;
    uint64_t pos = vo->samplePos1616;
    const uint32_t inc = vo->sampleInc1616;
    const uint32_t lStart = vo->sampleLoopStart;
    const uint32_t lEnd = (vo->sampleLoopEnd > 0 && vo->sampleLoopEnd <= len) ? vo->sampleLoopEnd : len;
    int32_t currentEnv = startEnv;
    int32_t volBase = (int32_t)vo->vol * vo->trmModGain >> 8;
    bool dir = vo->sampleDirection;

    for (int i = 0; i < samples; i++) {
        uint32_t idx = (uint32_t)(pos >> 16);
        if (idx >= len) idx = (dir) ? len - 1 : 0;

        int16_t sampleVal = data[idx];
        int32_t finalVol = (currentEnv >> 20) * volBase;

        mixBuffer[i] += (sampleVal * finalVol) >> 16;
        currentEnv += envStep;

        if (dir) {
            pos += inc;
            if ((pos >> 16) >= lEnd) {
                if (vo->sampleLoopMode == LOOP_FORWARD) pos = (uint64_t)lStart << 16;
                else if (vo->sampleLoopMode == LOOP_PINGPONG) {
                    dir = false;
                    pos = (uint64_t)lEnd << 16;
                } else if (vo->sampleLoopMode == LOOP_OFF) {
                    vo->sampleFinished = true;
                    break;
                }
            }
        } else {
            if (pos >= inc) pos -= inc;
            else pos = 0;
            if ((pos >> 16) <= lStart) {
                if (vo->sampleLoopMode == LOOP_PINGPONG) {
                    dir = true;
                    pos = (uint64_t)lStart << 16;
                } else if (vo->sampleLoopMode == LOOP_REVERSE) {
                    pos = (uint64_t)lEnd << 16;
                } else if (vo->sampleLoopMode == LOOP_OFF) {
                    vo->sampleFinished = true;
                    break;
                }
            }
        }
    }
    vo->samplePos1616 = pos;
    vo->sampleDirection = dir;
}

/**
 * @brief Renders an audio block for a wavetable voice.
 *        (Renderiza um bloco de áudio para uma voz de wavetable.)
 */
static void IRAM_ATTR renderBlockWavetable(Voice* vo, int32_t* mixBuffer, int samples, int32_t startEnv, int32_t envStep) {
    if (!vo->wtData) return;

    int32_t currentEnv = startEnv;
    int32_t volBase = (int32_t)vo->vol * vo->trmModGain >> 8;
    uint32_t ph = vo->phase;
    uint32_t inc = vo->phaseInc + vo->vibOffset;
    const uint32_t size = vo->wtSize;

    switch (vo->depth) {
    case BITS_16:
        {
            const int16_t* data = (const int16_t*)vo->wtData;
            for (int i = 0; i < samples; i++) {
                uint32_t idx = (uint32_t)(((uint64_t) ph * size) >> 32);
                int16_t s = data[idx];
                int32_t finalVol = (currentEnv >> 20) * volBase;
                mixBuffer[i] += (s * finalVol) >> 16;
                ph += inc;
                currentEnv += envStep;
            }
            break;
        }

    case BITS_8:
        {
            const uint8_t* data = (const uint8_t*)vo->wtData;
            for (int i = 0; i < samples; i++) {
                uint32_t idx = (uint32_t)(((uint64_t) ph * size) >> 32);
                int16_t s = ((int16_t) data[idx] - 128) << 8;
                int32_t finalVol = (currentEnv >> 20) * volBase;
                mixBuffer[i] += (s * finalVol) >> 16;
                ph += inc;
                currentEnv += envStep;
            }
            break;
        }

    case BITS_4:
        {
            const uint8_t* data = (const uint8_t*)vo->wtData;
            for (int i = 0; i < samples; i++) {
                uint32_t idx = (uint32_t)(((uint64_t) ph * size) >> 32);
                uint8_t shift = (idx & 1) << 2; // 0 for even, 4 for odd
                uint8_t val = (data[idx >> 1] >> shift) & 0x0F;
                int16_t s = ((int16_t) val - 8) * 4096;

                int32_t finalVol = (currentEnv >> 20) * volBase;
                mixBuffer[i] += (s * finalVol) >> 16;
                ph += inc;
                currentEnv += envStep;
            }
            break;
        }
    }
    vo->phase = ph;
}

/**
 * @brief Renders an audio block for a basic wave voice (saw, sine, pulse, triangle).
 *        (Renderiza um bloco de áudio para uma voz de onda básica.)
 */
static void IRAM_ATTR renderBlockBasic(Voice* vo, int32_t* mixBuffer, int samples, int32_t startEnv, int32_t envStep) {
    int32_t currentEnv = startEnv;
    int32_t volBase = (int32_t)vo->vol * vo->trmModGain >> 8;
    uint32_t ph = vo->phase;
    uint32_t inc = vo->phaseInc + vo->vibOffset;
    const WaveType type = vo->type;
    const uint32_t pw = vo->pulseWidth;

