rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
    if (type == WAVE_SAW) {
        for (int i = 0; i < samples; i++) {
            int16_t s = (int16_t)(ph >> 16);
            int32_t finalVol = (currentEnv >> 20) * volBase;
            mixBuffer[i] += (s * finalVol) >> 16;
            ph += inc;
            currentEnv += envStep;
        }
    } else if (type == WAVE_SINE) {
        for (int i = 0; i < samples; i++) {
            int32_t s = sineLUT[ph >> SINE_SHIFT];
            int32_t finalVol = (currentEnv >> 20) * volBase;
            mixBuffer[i] += (int32_t)(((int64_t) s * finalVol) >> 31);
            ph += inc;
            currentEnv += envStep;
        }
    } else if (type == WAVE_PULSE) {
        for (int i = 0; i < samples; i++) {
            int16_t s = (ph < pw) ? 20000 : -20000;
            int32_t finalVol = (currentEnv >> 20) * volBase;
            mixBuffer[i] += (s * finalVol) >> 16;
            ph += inc;
            currentEnv += envStep;
        }
    } else if (type == WAVE_TRIANGLE) {
        for (int i = 0; i < samples; i++) {
            int16_t saw = (int16_t)(ph >> 16);
            int16_t s = (int16_t)(((saw ^ (saw >> 15)) * 2) - 32767);
            int32_t finalVol = (currentEnv >> 20) * volBase;
            mixBuffer[i] += (s * finalVol) >> 16;
            ph += inc;
            currentEnv += envStep;
        }
    }
    vo->phase = ph;
}

/**
 * @brief Renders an audio block for a noise voice.
 *        (Renderiza um bloco de áudio para uma voz de ruído.)
 */
static void IRAM_ATTR renderBlockNoise(Voice* vo, int32_t* mixBuffer, int samples, int32_t startEnv, int32_t envStep) {
    int32_t currentEnv = startEnv;
    int32_t volBase = (int32_t)vo->vol * vo->trmModGain >> 8;
    uint32_t rng = vo->rngState;
    uint32_t ph = vo->phase;
    uint32_t inc = (vo->phaseInc + vo->vibOffset) << 4;
    int16_t currentSample = vo->noiseSample;

    for (int i = 0; i < samples; i++) {
        uint32_t nextPh = ph + inc;
        if (nextPh < ph) {
            rng = (rng * 1664525) + 1013904223;
            currentSample = (int16_t)(rng >> 16);
        }
        ph = nextPh;
        int32_t finalVol = (currentEnv >> 20) * volBase;
        mixBuffer[i] += (currentSample * finalVol) >> 16;
        currentEnv += envStep;
    }
    vo->rngState = rng;
    vo->phase = ph;
    vo->noiseSample = currentSample;
}

// =================================================================================
// ADSR Envelope Update
// =================================================================================

/**
 * @brief Updates the ADSR envelope state for a block of samples.
 *        (Atualiza o estado do envelope ADSR para um bloco de samples.)
 */
static inline void updateAdsrBlock(Voice* vo, int samples, int32_t& startEnv, int32_t& envStep) {
    // For Tracker-style instruments, ADSR is controlled by the instrument.
    // (Para instrumentos de Tracker, o ADSR é controlado pelo instrumento.)
    if (vo->inst) {
        startEnv = ENV_MAX;
        vo->currEnvVal = ENV_MAX;
        envStep = 0;
        return;
    }

    startEnv = vo->currEnvVal;

    // If the envelope is stable, the step is zero.
    // (Se o envelope está estável, o passo é zero.)
    if (vo->envState == ENV_IDLE || vo->envState == ENV_SUSTAIN) {
        envStep = 0;
        return;
    }

    uint32_t target = vo->currEnvVal;
    uint32_t steps = (uint32_t) samples;

    switch (vo->envState) {
    case ENV_ATTACK:
        if (vo->rateAttack >= ENV_MAX) {
            target = ENV_MAX;
            vo->envState = ENV_DECAY;
            startEnv = ENV_MAX;
            envStep = 0;
        } else if (ENV_MAX - target > vo->rateAttack * steps) {
            target += vo->rateAttack * steps;
            envStep = (target - startEnv) / samples;
        } else {
            target = ENV_MAX;
            vo->envState = ENV_DECAY;
            envStep = (target - startEnv) / samples;
        }
        break;

    case ENV_DECAY:
        if (vo->rateDecay >= ENV_MAX) {
            target = vo->levelSustain;
            vo->envState = ENV_SUSTAIN;
            startEnv = target;
            envStep = 0;
        } else if (target > vo->levelSustain && (target - vo->levelSustain) > vo->rateDecay * steps) {
            target -= vo->rateDecay * steps;
            envStep = -((int32_t)vo->rateDecay);
        } else {
            target = vo->levelSustain;
            vo->envState = ENV_SUSTAIN;
            envStep = ((int32_t) target - (int32_t) startEnv) / samples;
        }
        break;

    case ENV_RELEASE:
        if (vo->rateRelease >= ENV_MAX) {
            target = 0;
            vo->active = false;
            vo->envState = ENV_IDLE;
            startEnv = 0;
            envStep = 0;
        } else if (target > vo->rateRelease * steps) {
            target -= vo->rateRelease * steps;
            envStep = -((int32_t)vo->rateRelease);
        } else {
            target = 0;
            vo->active = false;
            vo->envState = ENV_IDLE;
            envStep = -startEnv / samples;
            if (envStep == 0 && startEnv > 0) envStep = -1;
        }
        break;

    default:
        envStep = 0;
        break;
    }

    vo->currEnvVal = target;
}


// =================================================================================
// Constructor & Destructor
// =================================================================================

ESP32Synth::ESP32Synth() {
    _sampleRate = 48000; // Default safe value (Valor padrão seguro)

    // Initialize all voices to a default silent state.
    // (Inicializa todas as vozes para um estado silencioso padrão.)
    for (int i = 0; i < MAX_VOICES; i++) {
        voices[i].active = false;
        voices[i].type = WAVE_SINE;
        voices[i].envState = ENV_IDLE;
        voices[i].rngState = 12345 + (i * 999);
        voices[i].rateAttack = ENV_MAX;
        voices[i].rateDecay = 0;
        voices[i].levelSustain = ENV_MAX;
        voices[i].rateRelease = ENV_MAX;
        voices[i].vibPhase = 0;
        voices[i].trmPhase = 0;
        voices[i].pulseWidth = 0x80000000;
        voices[i].inst = nullptr;
        voices[i].instSample = nullptr;
        voices[i].samplePos1616 = 0;
        voices[i].sampleInc1616 = 0;
        voices[i].sampleLoopMode = LOOP_OFF;
        voices[i].sampleFinished = false;
        voices[i].wtData = nullptr;
        voices[i].wtSize = 0;
    }

    // Clear the wavetable registry.
    // (Limpa o registro de wavetables.)
    for (uint16_t i = 0; i < MAX_WAVETABLES; i++) {
        wavetables[i].data = nullptr;
        wavetables[i].size = 0;
        wavetables[i].depth = BITS_8;
    }

