rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
    controlSampleCounter = 0;
    controlRateHz = 100;
}

ESP32Synth::~ESP32Synth() {
    // Gracefully shut down the I2S channel if it was initialized.
    // (Desliga graciosamente o canal I2S se foi inicializado.)
    if (tx_handle) {
        i2s_channel_disable(tx_handle);
        i2s_del_channel(tx_handle);
    }
}


// =================================================================================
// Initialization (begin methods)
// =================================================================================

bool ESP32Synth::begin(int dacPin) {
    // Calls the main function configured for DAC output.
    // (Chama a função principal configurada para saída DAC.)
    return begin(dacPin, SMODE_DAC, -1, -1, I2S_16BIT);
}

bool ESP32Synth::begin(int bckPin, int wsPin, int dataPin) {
    // Calls the main function configured for 16-bit I2S.
    // (Chama a função principal configurada para I2S de 16 bits.)
    return begin(dataPin, SMODE_I2S, bckPin, wsPin, I2S_16BIT);
}

bool ESP32Synth::begin(int bckPin, int wsPin, int dataPin, I2S_Depth i2sDepth) {
    // Calls the main function with the specified I2S bit depth.
    // (Chama a função principal com a profundidade de bits I2S especificada.)
    return begin(dataPin, SMODE_I2S, bckPin, wsPin, i2sDepth);
}

bool ESP32Synth::begin(int dataPin, SynthOutputMode mode, int clkPin, int wsPin, I2S_Depth i2sDepth) {
    this->currentMode = mode;
    this->_i2sDepth = i2sDepth;

    // Set sample rate based on chip and mode.
    // (Define a taxa de amostragem com base no chip e no modo.)
    #if defined(CONFIG_IDF_TARGET_ESP32S3)
    if (mode == SMODE_PDM) _sampleRate = 52036;
    else _sampleRate = 48000;
    #else
    _sampleRate = 48000;
    #endif

    controlIntervalSamples = (_sampleRate / controlRateHz) ? (_sampleRate / controlRateHz) : 1;

    // Fill the sine table with 31-bit amplitude.
    // (Preenche a tabela de seno com amplitude de 31 bits.)
    for (int i = 0; i < SINE_LUT_SIZE; i++) {
        sineLUT[i] = (int32_t)(sin(i * 2.0 * PI / (double) SINE_LUT_SIZE) * 1050000000.0);
    }

    if (mode == SMODE_DAC) {
        #if !defined(CONFIG_IDF_TARGET_ESP32)
        Serial.println("SMODE_DAC Error: Not supported on this ESP32 variant.");
        return false;
        #else
        dac_continuous_config_t cont_cfg = {
            .chan_mask = (dataPin == 26) ? DAC_CHANNEL_MASK_CH1 : DAC_CHANNEL_MASK_CH0,
            .desc_num = 8,
            .buf_size = 2048,
            .freq_hz = _sampleRate,
            .offset = 0,
            .clk_src = DAC_DIGI_CLK_SRC_DEFAULT,
            .chan_mode = DAC_CHANNEL_MODE_SIMUL,
        };
        if (dac_continuous_new_channels(&cont_cfg, &dac_handle) != ESP_OK) return false;
        if (dac_continuous_enable(dac_handle) != ESP_OK) return false;
        #endif
    } else {
        i2s_port_t requested_port = (mode == SMODE_PDM) ? I2S_NUM_0 : I2S_NUM_AUTO;
        i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(requested_port, I2S_ROLE_MASTER);
        chan_cfg.dma_desc_num = 8;
        chan_cfg.dma_frame_num = 512;

        if (i2s_new_channel(&chan_cfg, &tx_handle, NULL) != ESP_OK) return false;

        if (mode == SMODE_PDM) {
            i2s_pdm_tx_config_t pdm_cfg = {
                .clk_cfg = I2S_PDM_TX_CLK_DEFAULT_CONFIG(_sampleRate),
                .slot_cfg = I2S_PDM_TX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO),
                .gpio_cfg = {
                    .clk = (gpio_num_t) clkPin, .dout = (gpio_num_t) dataPin
                }
            };
            if (i2s_channel_init_pdm_tx_mode(tx_handle, &pdm_cfg) != ESP_OK) return false;
        } else { // Standard I2S Mode
            i2s_data_bit_width_t width = (i2sDepth == I2S_32BIT) ? I2S_DATA_BIT_WIDTH_32BIT : I2S_DATA_BIT_WIDTH_16BIT;
            i2s_std_config_t std_cfg = {
                .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sampleRate),
                .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(width, I2S_SLOT_MODE_STEREO),
                .gpio_cfg = {
                    .mclk = I2S_GPIO_UNUSED,
                    .bclk = (gpio_num_t) clkPin,
                    .ws = (gpio_num_t) wsPin,
                    .dout = (gpio_num_t) dataPin
                }
            };
            if (i2s_channel_init_std_mode(tx_handle, &std_cfg) != ESP_OK) return false;
        }

        if (i2s_channel_enable(tx_handle) != ESP_OK) return false;
    }

    // Create and pin the audio processing task.
    // (Cria e fixa a tarefa de processamento de áudio.)
    xTaskCreatePinnedToCore(audioTask, "SynthTask", 4096, this, configMAX_PRIORITIES - 1, NULL, 1);
    return true;
}


// =================================================================================
// Audio Task & Main Render Loop
// =================================================================================

void ESP32Synth::audioTask(void* param) {
    ((ESP32Synth*)param)->renderLoop();
}

void ESP32Synth::renderLoop() {
    int32_t buf[512];
    size_t written;

    while (1) {
        render(buf, 512);

        if (currentMode == SMODE_DAC) {
            #if defined(CONFIG_IDF_TARGET_ESP32)
            int16_t* buf16 = (int16_t*)buf;
            uint8_t dacBuf[512];
            for (int i = 0; i < 512; i++) dacBuf[i] = (uint8_t)((buf16[i] + 32768) >> 8);
            dac_continuous_write(dac_handle, dacBuf, 512, &written, portMAX_DELAY);
            #endif
        } else if (currentMode == SMODE_I2S) {
            if (_i2sDepth == I2S_32BIT) {
                int32_t smallStereo32[128];
                for (int offset = 0; offset < 512; offset += 64) {
                    for (int i = 0; i < 64; i++) {
                        int32_t s = buf[offset + i];
                        smallStereo32[i * 2] = s;
                        smallStereo32[i * 2 + 1] = s;
                    }
                    i2s_channel_write(tx_handle, smallStereo32, sizeof(smallStereo32), &written, portMAX_DELAY);
                }
            } else { // 16-bit or 8-bit depth
                int16_t* buf16 = (int16_t*)buf;
                int16_t smallStereo16[128];
                for (int offset = 0; offset < 512; offset += 64) {
                    for (int i = 0; i < 64; i++) {
                        int16_t s = buf16[offset + i];
                        smallStereo16[i * 2] = s;
                        smallStereo16[i * 2 + 1] = s;
                    }
                    i2s_channel_write(tx_handle, smallStereo16, sizeof(smallStereo16), &written, portMAX_DELAY);
                }
            }
        } else { // PDM
            i2s_channel_write(tx_handle, buf, 512 * sizeof(int16_t), &written, portMAX_DELAY);
        }
    }
}

void IRAM_ATTR ESP32Synth::render(void* buffer, int samples) {
    static int32_t mix[512];
    memset(mix, 0, samples * sizeof(int32_t));

