rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
    // Process control logic at a fixed rate.
    // (Processa a lógica de controle a uma taxa fixa.)
    controlSampleCounter += (uint32_t) samples;
    while (controlSampleCounter >= controlIntervalSamples) {
        processControl();
        controlSampleCounter -= controlIntervalSamples;
    }

    // Render each active voice into the mix buffer.
    // (Renderiza cada voz ativa no buffer de mixagem.)
    for (int v = 0; v < MAX_VOICES; v++) {
        Voice* vo = &voices[v];
        if (!vo->active) continue;

        int32_t startEnv, envStep;
        updateAdsrBlock(vo, samples, startEnv, envStep);
        if (startEnv == 0 && vo->currEnvVal == 0 && vo->envState != ENV_ATTACK) continue;

        if (!vo->inst) {
            if (vo->type == WAVE_SAMPLE) renderBlockSample(vo, mix, samples, startEnv, envStep);
            else if (vo->type == WAVE_WAVETABLE) renderBlockWavetable(vo, mix, samples, startEnv, envStep);
            else if (vo->type == WAVE_NOISE) renderBlockNoise(vo, mix, samples, startEnv, envStep);
            else renderBlockBasic(vo, mix, samples, startEnv, envStep);
        } else {
            if (vo->currWaveIsBasic) {
                WaveType oldType = vo->type;
                vo->type = (WaveType)vo->currWaveType;
                if (vo->type == WAVE_NOISE) renderBlockNoise(vo, mix, samples, startEnv, envStep);
                else renderBlockBasic(vo, mix, samples, startEnv, envStep);
                vo->type = oldType;
            } else {
                renderBlockWavetable(vo, mix, samples, startEnv, envStep);
            }
        }
    }

    // Final processing and writing to the output buffer.
    // (Processamento final e escrita no buffer de saída.)
    if (currentMode == SMODE_I2S && _i2sDepth == I2S_32BIT) {
        int32_t* buf32 = (int32_t*)buffer;
        for (int i = 0; i < samples; i++) {
            int32_t val = mix[i];
            val = (val * _masterVolume) >> 8;
            if (val > 32767) val = 32767;
            else if (val < -32768) val = -32768;
            buf32[i] = val << 16;
        }
    } else if (currentMode == SMODE_I2S && _i2sDepth == I2S_8BIT) {
        int16_t* buf16 = (int16_t*)buffer;
        for (int i = 0; i < samples; i++) {
            int32_t val = mix[i];
            val = (val * _masterVolume) >> 9;
            if (val > 32767) val = 32767;
            else if (val < -32768) val = -32768;
            buf16[i] = (int16_t)(val & 0xFF00); // 8-bit bitcrush
        }
    } else { // Default 16-bit for I2S, PDM, or DAC
        int16_t* buf16 = (int16_t*)buffer;
        for (int i = 0; i < samples; i++) {
            int32_t val = mix[i];
            val = (val * _masterVolume) >> 9;
            if (val > 32767) val = 32767;
            else if (val < -32768) val = -32768;
            buf16[i] = (int16_t) val;
        }
    }
}


// =================================================================================
// Public Voice Control Methods
// =================================================================================

void ESP32Synth::noteOn(uint8_t voice, uint32_t freqCentiHz, uint8_t volume) {
    if (voice >= MAX_VOICES) return;
    Voice* vo = &voices[voice];

    vo->freqVal = freqCentiHz;
    vo->vol = volume;
    vo->active = true;

    // Calculate phase increment for the given frequency.
    // (Calcula o incremento de fase para a frequência dada.)
    uint64_t num = (uint64_t) freqCentiHz << 32;
    uint32_t den = _sampleRate * 100;
    vo->phaseInc = (uint32_t)(num / den);

    // Ensure control logic runs immediately.
    // (Garante que a lógica de controle execute imediatamente.)
    controlSampleCounter = controlIntervalSamples;

    if (vo->inst) {
        // --- Tracker Instrument Note On ---
        vo->envState = ENV_ATTACK;
        vo->currEnvVal = ENV_MAX;
        vo->stageIdx = 0;
        vo->controlTick = 0;
        vo->currWaveId = 0;
        vo->currWaveIsBasic = 0;
        vo->nextWaveId = 0;
        vo->morph = 0;
        processControl();
    } else if (vo->instSample) {
        // --- Sample-based Instrument Note On ---
        vo->type = WAVE_SAMPLE;
        vo->envState = ENV_ATTACK;
        vo->currEnvVal = ENV_MAX;
        vo->sampleFinished = false;
        vo->sampleLoopMode = vo->instSample->loopMode;
        vo->sampleLoopStart = vo->instSample->loopStart;

        const SampleData* sData = nullptr;
        uint32_t root = 0;
        for (int i = 0; i < vo->instSample->numZones; i++) {
            const SampleZone* z = &vo->instSample->zones[i];
            if (freqCentiHz >= z->lowFreq && freqCentiHz <= z->highFreq) {
                if (z->sampleId < MAX_SAMPLES) {
                    sData = &registeredSamples[z->sampleId];
                    vo->curSampleId = z->sampleId;
                    root = (z->rootOverride > 0) ? z->rootOverride : sData->rootFreqCentiHz;
                }
                break;
            }
        }

        if (sData) {
            vo->sampleLoopEnd = (vo->instSample->loopEnd == 0 || vo->instSample->loopEnd > sData->length) ?
                sData->length :
                vo->instSample->loopEnd;
        }

        vo->sampleDirection = (vo->sampleLoopMode != LOOP_REVERSE);
        vo->samplePos1616 = (vo->sampleDirection) ? 0 : ((uint64_t)sData->length << 16);

        if (sData && sData->data && root > 0) {
            float pitchRatio = (float) freqCentiHz / (float) root;
            float rateRatio = (float)sData->sampleRate / (float)_sampleRate;
            vo->sampleInc1616 = (uint32_t)(pitchRatio * rateRatio * 65536.0f);
        } else {
            vo->sampleInc1616 = 0;
        }
    } else {
        // --- Basic Waveform / Raw Sample Note On ---
        if (vo->type == WAVE_NOISE) {
            vo->rngState += micros();
        } else if (vo->type == WAVE_SAMPLE) {
            vo->sampleFinished = false;
            const SampleData* sData = &registeredSamples[vo->curSampleId];
            vo->sampleDirection = (vo->sampleLoopMode != LOOP_REVERSE);
            vo->samplePos1616 = (vo->sampleDirection) ? 0 : ((uint64_t)sData->length << 16);

            if (sData->data && sData->rootFreqCentiHz > 0) {
                uint64_t ratio1616 = ((uint64_t)freqCentiHz << 16) / sData->rootFreqCentiHz;
                vo->sampleInc1616 = (uint32_t)((ratio1616 * sData->sampleRate) / _sampleRate);
            } else {
                vo->sampleInc1616 = 0;
            }
        } else {
            vo->phase = 0;
        }

