rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
        if (vo->arpActive) {
            vo->arpIdx = 0;
            vo->arpTickCounter = 0;
        }

        // Start the envelope.
        // (Inicia o envelope.)
        if (vo->rateAttack >= ENV_MAX) {
            vo->currEnvVal = ENV_MAX;
            vo->envState = ENV_DECAY;
        } else {
            vo->currEnvVal = 0;
            vo->envState = ENV_ATTACK;
        }
    }
}

void ESP32Synth::noteOff(uint8_t voice) {
    if (voice < MAX_VOICES && voices[voice].active) {
        voices[voice].envState = ENV_RELEASE;
        voices[voice].stageIdx = 0;
        voices[voice].controlTick = 0;
    }
}

void ESP32Synth::setFrequency(uint8_t voice, uint32_t freqCentiHz) {
    if (voice >= MAX_VOICES) return;
    Voice* v = &voices[voice];
    v->freqVal = freqCentiHz;

    if (v->type == WAVE_SAMPLE && v->instSample == nullptr) {
        const SampleData* sData = &registeredSamples[v->curSampleId];
        if (sData->data && sData->rootFreqCentiHz > 0) {
            uint64_t ratio1616 = ((uint64_t)freqCentiHz << 16) / sData->rootFreqCentiHz;
            v->sampleInc1616 = (uint32_t)((ratio1616 * sData->sampleRate) / _sampleRate);
        }
    } else {
        v->phaseInc = (uint32_t)(((uint64_t)freqCentiHz * 4294967296ULL) / (_sampleRate * 100ULL));
    }
}

void ESP32Synth::setVolume(uint8_t voice, uint8_t volume) {
    if (voice < MAX_VOICES) voices[voice].vol = volume;
}

void ESP32Synth::setWave(uint8_t voice, WaveType type) {
    if (voice < MAX_VOICES) voices[voice].type = type;
}

void ESP32Synth::setPulseWidth(uint8_t voice, uint8_t width) {
    if (voice < MAX_VOICES) voices[voice].pulseWidth = (uint32_t) width << 24;
}

void ESP32Synth::setEnv(uint8_t voice, uint16_t a, uint16_t d, uint8_t s, uint16_t r) {
    if (voice >= MAX_VOICES) return;
    Voice* v = &voices[voice];
    v->levelSustain = (uint32_t)s * (ENV_MAX / 255);
    uint32_t samplesPerMs = _sampleRate / 1000;
    v->rateAttack = (a == 0) ? ENV_MAX : ENV_MAX / ((uint32_t)a * samplesPerMs);
    v->rateDecay = (d == 0) ? ENV_MAX : ENV_MAX / ((uint32_t)d * samplesPerMs);
    v->rateRelease = (r == 0) ? ENV_MAX : ENV_MAX / ((uint32_t)r * samplesPerMs);
    v->attackMs = a;
    v->decayMs = d;
    v->releaseMs = r;
}

void ESP32Synth::setVibrato(uint8_t voice, uint32_t rateCentiHz, uint32_t depthCentiHz) {
    if (voice >= MAX_VOICES) return;
    voices[voice].vibRateInc = rateCentiHz * 895; // Magic number for rate
    voices[voice].vibDepthInc = depthCentiHz * 733; // Magic number for depth
}

void ESP32Synth::setTremolo(uint8_t voice, uint32_t rateCentiHz, uint16_t depth) {
    if (voice >= MAX_VOICES) return;
    voices[voice].trmRateInc = rateCentiHz * 895; // Magic number for rate
    voices[voice].trmDepth = depth;
}

void ESP32Synth::setControlRateHz(uint16_t hz) {
    if (hz > 0) {
        controlRateHz = hz;
        controlIntervalSamples = (_sampleRate / controlRateHz) ? (_sampleRate / controlRateHz) : 1;
    }
}

void ESP32Synth::setMasterVolume(uint8_t volume) {
    _masterVolume = volume;
}

uint8_t ESP32Synth::getMasterVolume() {
    return _masterVolume;
}


// =================================================================================
// Portamento / Slide
// =================================================================================

void ESP32Synth::slide(uint8_t voice, uint32_t startFreqCentiHz, uint32_t endFreqCentiHz, uint32_t durationMs) {
    if (voice >= MAX_VOICES) return;
    Voice* v = &voices[voice];
    uint32_t ticks = (durationMs == 0) ? 0 : ((durationMs * controlRateHz + 999) / 1000);

    uint64_t numEnd = (uint64_t) endFreqCentiHz << 32;
    uint32_t den = _sampleRate * 100;
    uint32_t endInc = (uint32_t)(numEnd / den);

    if (ticks == 0) {
        v->phaseInc = endInc;
        v->freqVal = endFreqCentiHz;
        v->slideActive = false;
        return;
    }

    uint64_t numStart = (uint64_t) startFreqCentiHz << 32;
    uint32_t startInc = (uint32_t)(numStart / den);
    int64_t diff = (int64_t) endInc - (int64_t) startInc;
    int32_t delta = (int32_t)(diff / (int64_t)ticks);
    int64_t rem = diff - (int64_t)delta * (int64_t)ticks;

    v->phaseInc = startInc;
    v->slideDeltaInc = delta;
    v->slideRem = (int32_t)rem;
    v->slideRemAcc = 0;
    v->slideTicksTotal = ticks;
    v->slideTicksRemaining = ticks;
    v->slideTargetInc = endInc;
    v->slideTargetFreqCenti = endFreqCentiHz;
    v->slideActive = true;
    v->freqVal = startFreqCentiHz;
}

void ESP32Synth::slideTo(uint8_t voice, uint32_t endFreqCentiHz, uint32_t durationMs) {
    if (voice >= MAX_VOICES) return;
    uint32_t start = voices[voice].freqVal;
    if (start == 0) { // If current freq is 0, derive from phaseInc
        uint64_t curNum = (uint64_t)voices[voice].phaseInc * (uint64_t)_sampleRate * 100;
        start = (voices[voice].phaseInc != 0) ? (uint32_t)(curNum >> 32) : endFreqCentiHz;
    }
    slide(voice, start, endFreqCentiHz, durationMs);
}


// =================================================================================
// Wavetable & Instrument Management
// =================================================================================

void ESP32Synth::setWavetable(uint8_t voice,
    const void* data, uint32_t size, BitDepth depth) {
    if (voice < MAX_VOICES) {
        voices[voice].wtData = data;
        voices[voice].wtSize = size;
        voices[voice].depth = depth;
    }
}

// Legacy function to set wavetable for all voices.
// (Função legada para definir wavetable para todas as vozes.)
void ESP32Synth::setWavetable(const void* data, uint32_t size, BitDepth depth) {
    for (int i = 0; i < MAX_VOICES; i++) {
        voices[i].wtData = data;
        voices[i].wtSize = size;
        voices[i].depth = depth;
    }
}

void ESP32Synth::registerWavetable(uint16_t id,
    const void* data, uint32_t size, BitDepth depth) {
    if (id < MAX_WAVETABLES) {
        wavetables[id].data = data;
        wavetables[id].size = size;
        wavetables[id].depth = depth;
    }
}

void ESP32Synth::setInstrument(uint8_t voice, Instrument* inst) {
    if (voice >= MAX_VOICES) return;
    voices[voice].inst = inst;
    voices[voice].instSample = nullptr;
    voices[voice].stageIdx = 0;
    voices[voice].controlTick = 0;
    voices[voice].currEnvVal = (inst == nullptr) ? 0 : ENV_MAX;
    voices[voice].envState = (inst == nullptr) ? ENV_IDLE : ENV_ATTACK;
}

void ESP32Synth::detachInstrument(uint8_t voice, WaveType newWaveType) {
    if (voice >= MAX_VOICES) return;
    setInstrument(voice, (Instrument*)nullptr);
    setWave(voice, newWaveType);
}


// =================================================================================
// Sample Management
// =================================================================================

bool ESP32Synth::registerSample(uint16_t sampleId,
    const int16_t* data, uint32_t length, uint32_t sampleRate, uint32_t rootFreqCentiHz) {
    if (sampleId >= MAX_SAMPLES || data == nullptr) return false;

    registeredSamples[sampleId].data = data;
    registeredSamples[sampleId].length = length;
    registeredSamples[sampleId].sampleRate = sampleRate;
    registeredSamples[sampleId].rootFreqCentiHz = rootFreqCentiHz;
    return true;
}

void ESP32Synth::setSample(uint8_t voice, uint16_t sampleId, LoopMode loopMode, uint32_t loopStart, uint32_t loopEnd) {
    if (voice >= MAX_VOICES || sampleId >= MAX_SAMPLES) return;
    Voice* v = &voices[voice];
    v->type = WAVE_SAMPLE;
    v->curSampleId = sampleId;
    v->sampleLoopMode = loopMode;
    v->sampleLoopStart = loopStart;
    v->sampleLoopEnd = loopEnd;
    v->instSample = nullptr; // Detach sample instrument
}

