rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
void ESP32Synth::setSampleLoop(uint8_t voice, LoopMode loopMode, uint32_t loopStart, uint32_t loopEnd) {
    if (voice < MAX_VOICES) {
        Voice* v = &voices[voice];
        v->sampleLoopMode = loopMode;
        v->sampleLoopStart = loopStart;
        v->sampleLoopEnd = loopEnd;
    }
}

void ESP32Synth::setInstrument(uint8_t voice, Instrument_Sample* inst) {
    if (voice >= MAX_VOICES) return;
    voices[voice].instSample = inst;
    voices[voice].inst = nullptr;
    voices[voice].currEnvVal = 0;
    voices[voice].envState = ENV_IDLE;
}


// =================================================================================
// Arpeggiator
// =================================================================================

void ESP32Synth::detachArpeggio(uint8_t voice) {
    if (voice < MAX_VOICES) voices[voice].arpActive = false;
}


// =================================================================================
// Getters for Voice State
// =================================================================================

uint32_t ESP32Synth::getFrequencyCentiHz(uint8_t voice) {
    return (voice < MAX_VOICES) ? voices[voice].freqVal : 0;
}

uint8_t ESP32Synth::getVolume8Bit(uint8_t voice) {
    return (voice < MAX_VOICES) ? voices[voice].vol : 0;
}

uint8_t ESP32Synth::getEnv8Bit(uint8_t voice) {
    return (voice < MAX_VOICES) ? (uint8_t)(voices[voice].currEnvVal >> 20) : 0;
}

uint8_t ESP32Synth::getOutput8Bit(uint8_t voice) {
    if (voice >= MAX_VOICES) return 0;
    uint32_t env = voices[voice].currEnvVal >> 20;
    uint32_t vol = voices[voice].vol;
    return (uint8_t)((env * vol) >> 8);
}

uint32_t ESP32Synth::getVolumeRaw(uint8_t voice) {
    return (voice < MAX_VOICES) ? (uint32_t)voices[voice].vol : 0;
}

uint32_t ESP32Synth::getEnvRaw(uint8_t voice) {
    return (voice < MAX_VOICES) ? voices[voice].currEnvVal : 0;
}

uint32_t ESP32Synth::getOutputRaw(uint8_t voice) {
    if (voice >= MAX_VOICES) return 0;
    return (voices[voice].currEnvVal >> 8) * voices[voice].vol;
}

bool ESP32Synth::isVoiceActive(uint8_t voice) {
    return (voice < MAX_VOICES) ? voices[voice].active : false;
}

const char * ESP32Synth::getChipModel() {
    return SYNTH_CHIP;
}

int32_t ESP32Synth::getSampleRate() {
    return _sampleRate;
}


// =================================================================================
// Internal Helper Methods
// =================================================================================

/**
 * @brief Fetches a single sample from a registered wavetable. (IRAM safe)
 *        (Busca uma única amostra de uma wavetable registrada.)
 */
IRAM_ATTR int16_t ESP32Synth::fetchWavetableSample(uint16_t id, uint32_t phase) {
    if (id >= MAX_WAVETABLES) return 0;
    const auto& e = wavetables[id];
    if (!e.data || e.size == 0) return 0;

    uint32_t idx = (uint32_t)(((uint64_t) phase * e.size) >> 32);

    if (e.depth == BITS_8) {
        return (((uint8_t*)e.data)[idx] - 128) << 8;
    } else if (e.depth == BITS_4) {
        const uint8_t* p = (const uint8_t*)e.data;
        uint8_t val = p[idx / 2];
        val = ((idx & 1) == 0) ? (val & 0x0F) : (val >> 4);
        return ((int16_t) val - 8) * 4096;
    }

    // Default to 16-bit
    return ((int16_t*)e.data)[idx];
}


// =================================================================================
// Main Control Processing (IRAM_ATTR)
// =================================================================================

/**
 * @brief Processes control-rate logic for all voices (LFOs, arpeggiator, slide, instruments).
 *        (Processa a lógica de controle para todas as vozes (LFOs, arpejador, slide, instrumentos).)
 */
void IRAM_ATTR ESP32Synth::processControl() {
    for (int v = 0; v < MAX_VOICES; v++) {
        Voice* vo = &voices[v];

        // --- LFOs (Vibrato and Tremolo) ---
        if (vo->vibDepthInc > 0) {
            vo->vibPhase += (vo->vibRateInc * controlIntervalSamples);
            int16_t lfoVal = (int16_t)(sineLUT[vo->vibPhase >> SINE_SHIFT] >> 16);
            vo->vibOffset = ((int64_t)vo->vibDepthInc * lfoVal) >> 14;
        } else {
            vo->vibOffset = 0;
        }

        if (vo->trmDepth > 0) {
            vo->trmPhase += (vo->trmRateInc * controlIntervalSamples);
            int16_t lfo = (int16_t)(sineLUT[vo->trmPhase >> SINE_SHIFT] >> 16);
            int32_t magnitude = (int32_t) lfo + 20000;
            int32_t reduction = (magnitude * vo->trmDepth) >> 15;
            vo->trmModGain = 255 - ((reduction > 255) ? 255 : reduction);
        } else {
            vo->trmModGain = 255;
        }

        // --- Arpeggiator ---
        if (vo->arpActive && vo->arpLen > 0) {
            if (vo->arpTickCounter == 0) {
                uint32_t targetFreq = vo->arpNotes[vo->arpIdx];
                setFrequency(v, targetFreq); // Use setFrequency to handle all wave types
                vo->arpIdx = (vo->arpIdx + 1) % vo->arpLen;
                vo->arpTickCounter = ((uint32_t)vo->arpSpeedMs * (uint32_t)controlRateHz + 999) / 1000;
                if (vo->arpTickCounter == 0) vo->arpTickCounter = 1;
            }
            vo->arpTickCounter--;
        }

        // --- Portamento (Slide) ---
        if (vo->slideActive && vo->slideTicksRemaining > 0) {
            vo->phaseInc = (uint32_t)((int32_t)vo->phaseInc + vo->slideDeltaInc);
            if (vo->slideRem != 0 && vo->slideTicksTotal > 0) {
                vo->slideRemAcc += vo->slideRem;
                int32_t sign = (vo->slideRem > 0) ? 1 : -1;
                if (abs(vo->slideRemAcc) >= (int32_t)vo->slideTicksTotal) {
                    vo->phaseInc = (uint32_t)((int32_t)vo->phaseInc + sign);
                    vo->slideRemAcc -= sign * (int32_t)vo->slideTicksTotal;
                }
            }
            vo->slideTicksRemaining--;
            vo->freqVal = (uint32_t)(((uint64_t)vo->phaseInc * (uint64_t)_sampleRate * 100) >> 32);
            if (vo->slideTicksRemaining == 0) {
                vo->phaseInc = vo->slideTargetInc;
                vo->freqVal = vo->slideTargetFreqCenti;
                vo->slideActive = false;
            }
        }

        // --- Tracker Instrument Logic ---
        if (!vo->active || !vo->inst) continue;
        Instrument* inst = vo->inst;
        int16_t wVal = 0;
        uint8_t nextVol = 0;
        bool updateNeeded = false;
        uint8_t len;
        uint32_t ms;
        uint8_t idx;

        switch (vo->envState) {
        case ENV_ATTACK:
            len = inst->seqLen;
            if (len == 0) {
                vo->envState = ENV_SUSTAIN;
                break;
            }
            if (vo->controlTick == 0) {
                ms = inst->seqSpeedMs;
                vo->controlTick = (ms == 0) ? 1 : ((uint32_t)ms * (uint32_t)controlRateHz + 999) / 1000;
            }
            idx = vo->stageIdx;
            if (idx >= len) idx = len - 1;
            wVal = inst->seqWaves[idx];
            nextVol = inst->seqVolumes[idx];
            updateNeeded = true;
            if (vo->controlTick > 0) vo->controlTick--;
            if (vo->controlTick == 0) {
                vo->stageIdx++;
                if (vo->stageIdx >= len) vo->envState = ENV_SUSTAIN;
            }
            break;

        case ENV_SUSTAIN:
            wVal = inst->susWave;
            nextVol = inst->susVol;
            updateNeeded = true;
            break;

