rubenphi/BlocklyDuino/v2/ablibs_cli/AB_72_ESP32synth/src/ESP32Synth.cpp
        case ENV_RELEASE:
            len = inst->relLen;
            if (len == 0) {
                vo->active = false;
                break;
            }
            if (vo->controlTick == 0) {
                ms = inst->relSpeedMs;
                vo->controlTick = (ms == 0) ? 1 : ((uint32_t)ms * (uint32_t)controlRateHz + 999) / 1000;
            }
            idx = vo->stageIdx;
            if (idx >= len) idx = len - 1;
            wVal = inst->relWaves[idx];
            nextVol = inst->relVolumes[idx];
            updateNeeded = true;
            if (vo->controlTick > 0) vo->controlTick--;
            if (vo->controlTick == 0) {
                vo->stageIdx++;
                if (vo->stageIdx >= len) vo->active = false;
            }
            break;

        default:
            break;
        }

        if (updateNeeded) {
            vo->vol = nextVol;
            if (wVal < 0) { // Basic Wave
                vo->currWaveIsBasic = 1;
                vo->currWaveId = 0;
                switch (wVal) {
                case W_SINE:
                    vo->currWaveType = WAVE_SINE;
                    break;
                case W_TRI:
                    vo->currWaveType = WAVE_TRIANGLE;
                    break;
                case W_SAW:
                    vo->currWaveType = WAVE_SAW;
                    break;
                case W_PULSE:
                    vo->currWaveType = WAVE_PULSE;
                    break;
                case W_NOISE:
                    vo->currWaveType = WAVE_NOISE;
                    break;
                default:
                    vo->currWaveType = WAVE_SINE;
                    break;
                }
            } else { // Wavetable
                vo->currWaveIsBasic = 0;
                vo->currWaveType = 0;
                vo->currWaveId = (uint16_t)wVal;

                if (vo->currWaveId < MAX_WAVETABLES) {
                    vo->wtData = wavetables[vo->currWaveId].data;
                    vo->wtSize = wavetables[vo->currWaveId].size;
                    vo->depth = wavetables[vo->currWaveId].depth;
                    if (vo->depth == 0) vo->depth = BITS_8; // Default
                }
            }
        }
    }
}